{
  "auto_mapping": null,
  "base_model_name_or_path": "distilgpt2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "revision": null,
  "target_modules": [
    "wte",
    "wpe",
    "c_attn",
    "c_proj",
    "c_fc",
    "lm_head"
  ],
  "task_type": "CAUSAL_LM"
}